﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <F81866Setup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_F81866_SIO_FORM                        #language eng "F81866 Super IO Configuration"
#string STR_F81866_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_F81866_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_F81866                                 #language eng "F81866"

//
//Serial 1/2/3/4/5/6 Settings
//
//Below are possible resource setting for all serial port
#string STR_F81866_SERIAL_IO3E8_IRQ7               #language eng "IO=3E8h; IRQ=7;"
#string STR_F81866_SERIAL_IO2E8_IRQ7               #language eng "IO=2E8h; IRQ=7;"
#string STR_F81866_SERIAL_IO2F0_IRQ7               #language eng "IO=2F0h; IRQ=7;"
#string STR_F81866_SERIAL_IO2E0_IRQ7               #language eng "IO=2E0h; IRQ=7;"
#string STR_F81866_SERIAL_IO3E8_IRQX               #language eng "IO=3E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_F81866_SERIAL_IO2E8_IRQX               #language eng "IO=2E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_F81866_SERIAL_IO2F0_IRQX               #language eng "IO=2F0h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_F81866_SERIAL_IO2E0_IRQX               #language eng "IO=2E0h; IRQ=3,4,5,6,7,9,10,11,12;"

#string STR_F81866_SERIAL6_MODE1                   #language eng "Disable IR1 function"
#string STR_F81866_SERIAL6_MODE2                   #language eng "Enable IR1 function, active pulse 1.6uS"
#string STR_F81866_SERIAL6_MODE3                   #language eng "Enable IR1 function, active pulse 3/16 bit time"
//
//Parallel Settings
//
#string STR_F81866_PARALLEL_IO378_IRQ5             #language eng "IO=378h; IRQ=5;"
#string STR_F81866_PARALLEL_IO378_IRQX             #language eng "IO=378h; IRQ=5,6,7,9,10,11,12;"
#string STR_F81866_PARALLEL_IO278_IRQX             #language eng "IO=278h; IRQ=5,6,7,9,10,11,12;"
#string STR_F81866_PARALLEL_IO3BC_IRQX             #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12;"

#string STR_F81866_PARALLELE_IO378_778_IRQ5_DMA3   #language eng "IO=378h; IRQ=5; DMA=3;"
#string STR_F81866_PARALLELE_IO378_778_IRQX_DMAX   #language eng "IO=378h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_F81866_PARALLELE_IO278_678_IRQX_DMAX   #language eng "IO=278h; IRQ=5,6,7,9,10,11,12; DMA=1,3;"
#string STR_F81866_PARALLELE_IO3BC_7BC_IRQX_DMAX   #language eng "IO=3BCh; IRQ=5,6,7,9,10,11,12; DMA=1,3;"

#string STR_F81866_PARALLEL_MODE0                  #language eng "STD Printer Mode"
#string STR_F81866_PARALLEL_MODE1                  #language eng "SPP Mode"
#string STR_F81866_PARALLEL_MODE2                  #language eng "EPP-1.9 and SPP Mode"
#string STR_F81866_PARALLEL_MODE3                  #language eng "EPP-1.7 and SPP Mode"
#string STR_F81866_PARALLEL_MODE4                  #language eng "ECP Mode"
#string STR_F81866_PARALLEL_MODE5                  #language eng "ECP and EPP 1.9 Mode"
#string STR_F81866_PARALLEL_MODE6                  #language eng "ECP and EPP 1.7 Mode"
#string STR_F81866_PARALLEL_MODE_HELP              #language eng "Change the Printer Port mode."


//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
